Revit 2025 API
ParameterTypeId.RebarShapeEndtreatmentStartType Property
 "End Treatment At Start"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static ForgeTypeId RebarShapeEndtreatmentStartType { get; }
Public Shared ReadOnly Property RebarShapeEndtreatmentStartType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeEndtreatmentStartType {
	ForgeTypeId^ get ();
}
static member RebarShapeEndtreatmentStartType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace